# На шахматной доске стоят белый король и черный конь. Конь неподвижен, король может ходить на одну клетку вправо,
# на одну клетку вверх или наискосок вправо-вверх. Посчитайте, сколькими способами король может дойти до клетки h8,
# начав с клетки a1. Королю нельзя попадать под атаку коня. Самого коня есть тоже нельзя.
# Строки шахматной доски пронумерованы числами от 1 до 8, столбцы буквами от a до h. Строка 1 - самая нижняя,
# столбец a - самый левый.
# Ввод: b2 Вывод: 4932
def reset_el(A, N, M, c):
    # Ставим c если в клетку можно походить конём

    for i in (-2, +1), (-1, +2), (+1, +2), (+2, +1), (+2, -1), (+1, -2), (-1, -2), (-2, -1):
        if N + i[0] > -1 and N + i[0] < 8 and M + i[1] > -1 and M + i[1] < 8:
            A[N + i[0]][M + i[1]] = c
    A[N][M] = c


def king(F, m=8, n=8):
    flag1 = 0
    flag2 = 0
    for i in range(n):
        if F[i][0] != -1 and flag1 == 0:
            F[i][0] = 1
        else:
            flag1 = 1
    for j in range(m):
        if F[0][j] != -1 and flag2 == 0:
            F[0][j] = 1
        else:
            flag2 = 1

    for i in range(1, n):
        for j in range(1, m):
            if F[i][j] != -1:
                if F[i][j - 1] == -1 and F[i - 1][j] != -1 and F[i - 1][j - 1] != -1:
                    F[i][j] = F[i - 1][j] + F[i - 1][j - 1]
                if F[i][j - 1] == -1 and F[i - 1][j] == -1 and F[i - 1][j - 1] != -1:
                    F[i][j] = F[i - 1][j - 1]
                if F[i][j - 1] == -1 and F[i - 1][j] == -1 and F[i - 1][j - 1] == -1:
                    F[i][j] = -1
                if F[i][j - 1] != -1 and F[i - 1][j] != -1 and F[i - 1][j - 1] != -1:
                    F[i][j] = F[i][j - 1] + F[i - 1][j] + F[i - 1][j - 1]
                if F[i][j - 1] != -1 and F[i - 1][j] == -1 and F[i - 1][j - 1] == -1:
                    F[i][j] = F[i][j - 1]
                if F[i][j - 1] != -1 and F[i - 1][j] != -1 and F[i - 1][j - 1] == -1:
                    F[i][j] = F[i][j - 1] + F[i - 1][j]
                if F[i][j - 1] != -1 and F[i - 1][j] == -1 and F[i - 1][j - 1] != -1:
                    F[i][j] = F[i][j - 1] + F[i - 1][j - 1]
                if F[i][j - 1] == -1 and F[i - 1][j] != -1 and F[i - 1][j - 1] == -1:
                    F[i][j] = F[i - 1][j]
        # print(F[i][j], end=' ')
        # print()


A = [[0] * 8 for i in range(8)]

l = input()
reset_el(A, int(l[1]) - 1, ord(l[0]) - 96 - 1, -1)

king(A)

print(A[7][7] if A[7][7] != -1 else 0)

