# Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение наибольшего
# элемента последовательности.
# Ввод: 1\n7\n9\n0 Вывод: 9
max1 = 0
while True:
    N = int(input())
    if N == 0:
        break
    if N > max1:
        max1 = N
print(max1)
